#include <stdio.h>
int main() {
    int N;
    double P = 0.0;

    // Εισαγωγή και έλεγχος τιμής του N
    do {
        printf("Δώσε τον αριθμό Ν(Από 1000 έως και 100.000):  ");
        scanf("%d", &N);

        if (N < 1000 || N > 100000) {
            printf("Λανθασμένη τιμή. Παρακαλώ δώστε έναν αριθμό μεταξύ 1000 και 100000.\n");
        }
    } while (N < 1000 || N > 100000);

    // Υπολογισμός π χρησιμοποιώντας τον τύπο
    for (int i = 0; i < N; i++) {
        if (i % 2 == 0) {
            P = P + 1.0 / (2 * i + 1);
        } else {
            P = P - 1.0 / (2 * i + 1);
        }
    }

    // Τελικός υπολογισμός του π
    P = P * 4;

    // Εμφάνιση του αποτελέσματος με ακρίβεια οκτώ δεκαδικών ψηφίων
    printf("Η τιμή του π είναι: %.8lf\n", P);

    return 0;
}
